Examinator/src/InformationRegisters/ДанныеВебКабинетаСУЗ_ПН/ДанныеВебКабинетаСУЗ_ПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУЗ_ПН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУЗ_ПН/ManagerModule.bsl
Процедура ДобавитьДанные(Пользователь, Тип, Объект, Данные, Формат) Экспорт	
	
	НаборЗаписей = РегистрыСведений.ДанныеВебКабинетаСУЗ_ПН.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Тип.Установить(Тип);
	НаборЗаписей.Отбор.Объект.Установить(Объект);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.Тип = Тип;
	НоваяЗапись.Объект = Объект;
	
	НоваяЗапись.Данные = Новый ХранилищеЗначения(Данные);
	НоваяЗапись.Формат = Формат;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();

	НаборЗаписей.Записать();	
	
КонецПроцедуры

Процедура УдалитьДанные(Объект=Неопределено, Тип=Неопределено, Пользователь=Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДанныеВебКабинетаСУЗ_ПН.СоздатьНаборЗаписей();

	Если Объект <> Неопределено Тогда
		НаборЗаписей.Отбор.Объект.Установить(Объект);
	КонецЕсли;
	
	Если Пользователь <> Неопределено Тогда
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);	
	КонецЕсли;
	
	Если Тип <> Неопределено Тогда
		НаборЗаписей.Отбор.Тип.Установить(Тип);	
	КонецЕсли;	
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
